BPMNs - Internet/215_DEACTIVATE_VAS/RequestPlanVASDelete.xml

<soapenv:Envelope 
  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
  <soapenv:Header/>
  <soapenv:Body>
    <v1:deactivateProduct>
      <!--Optional:-->
      <v1:simpleOrderRequest>
        <channelId>32</channelId>
        <subscriberId>94813475</subscriberId>
        <productId>486</productId>
        <quantity>1</quantity>
        <!--Optional:-->
        <externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
        <comment>AS400-Vas Provisioning</comment>
        <additionalParameters>
          <parameter>
            <key>eventType</key>
            <value>PLAN_VAS</value>
          </parameter>
          <parameter>
            <key>subevent</key>
            <value>DELETESUBS</value>
          </parameter>
          <parameter>
            <key>subscriberType</key>
            <value>POS</value>
          </parameter>
          <parameter>
            <key>typePlan</key>
            <value>NRM</value>
          </parameter>
          <parameter>
            <key>annex</key>
            <value>18176277</value>
          </parameter>
          <parameter>
            <key>TRANSACTIONID</key>
            <value>0105767400A10FFA1BE3269000</value>
          </parameter>
          <parameter>
            <key>TRANSTYPE</key>
            <value>2</value>
          </parameter>
          <parameter>
            <key>TRANSDATE</key>
            <value>20180606</value>
          </parameter>
          <parameter>
            <key>TRANSTIME</key>
            <value>164015</value>
          </parameter>
          <parameter>
            <key>SUBSNUMB</key>
            <value>94813475</value>
          </parameter>
          <parameter>
            <key>USER</key>
            <value>MAMEZA</value>
          </parameter>
          <parameter>
            <key>DEVICE</key>
            <value>QPADEV0008</value>
          </parameter>
          <parameter>
            <key>PROGRAM</key>
            <value>G3CLS001</value>
          </parameter>
          <parameter>
            <key>PLANCODE</key>
            <value>904</value>
          </parameter>
          <parameter>
            <key>PLANVAS</key>
            <value>13255</value>
          </parameter>
          <parameter>
            <key>ADDITVAS</key>
            <value>[MSRENTL#HN_HIB_LIM_8GB;SYNIVERSE#400MB_B2B_Roaming_Nacion_Tigo;\nSYNIVERSE2#397;SYNONDEMAN#N]</value>
          </parameter>
          <parameter>
            <key>IMSI</key>
            <value>708020000000000</value>
          </parameter>
          <parameter>
            <key>SIMCARD</key>
            <value>8950402502004778939</value>
          </parameter>
          <parameter>
            <key>BILLDAY</key>
            <value>31</value>
          </parameter>
          <parameter>
            <key>ENTITLEMENT</key>
            <value>HN_EMP_3G,Postpaid</value>
          </parameter>
          <parameter>
            <key>INCLUDE</key>
            <value>TRUE</value>
          </parameter>
        </additionalParameters>
        <!--Optional:-->
      </v1:simpleOrderRequest>
    </v1:deactivateProduct>
  </soapenv:Body>
</soapenv:Envelope>