SERVICIOS_AMSYS/RequestAmsysPH2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
  <soapenv:Header/>
  <soapenv:Body>
    <v1:purchaseProduct>
      <!--Optional:-->
      <v1:simpleOrderRequest>
        <channelId>65</channelId>
        <subscriberId>34234</subscriberId>
        <productId>1326</productId>
        <quantity>1</quantity>
        <!--Optional:-->
        <externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
        <comment>1</comment>
        <additionalParameters>
          <parameter>
            <key>SERVICES_PKG_1</key>
            <value>CM720;3434;DIGAV;A;10.44;DL;20180228</value>
          </parameter>
          <parameter>
            <key>SERVICES_ADD_2</key>
            <value>ADD;3437;HDDVB;A;10.44;DL;20180228</value>
          </parameter>
          <parameter>
            <key>SERVICES_PKG_2</key>
            <value>CM720;3435;BASIC;A;15.13;DL;20180228</value>
          </parameter>
          <parameter>
            <key>SERVICES_ADD_1</key>
            <value>ADD;3436;AVAHD;A;10.44;DL;20180228</value>
          </parameter>
        </additionalParameters>
        <!--Optional:-->
      </v1:simpleOrderRequest>
    </v1:purchaseProduct>
  </soapenv:Body>
</soapenv:Envelope>
