CO3 - BPMNs - CODE/Consulta de Facturas/258 - TRANSFER/XML/Request_Consulta_Facturas.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
	<soapenv:Header/>
	<soapenv:Body>
		<v1:transferProduct>
			<!--Optional:-->
			<v1:simpleOrderRequest>
				<channelId>1</channelId>
				<subscriberId>77777703</subscriberId>
				<productId>9002366</productId>
				<quantity>1</quantity>
				<!--Optional:-->
				<externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
				<comment>Consulta_Facturas_Abiertas</comment>
				<additionalParameters>
					<parameter>
						<key>SUBPRIMARY_IDENTITY</key>
						<value>TRUE</value>
					</parameter>
					<parameter>
						<key>ACCOUNT</key>
						<value>1-aacc77777703</value>
					</parameter>
					<parameter>
						<key>INVOICE_TYPE</key>
						<value>OPEN</value>
						<!--<value>CLOSED</value>-->
					</parameter>
				</additionalParameters>
				<!--Optional:-->
			</v1:simpleOrderRequest>
		</v1:transferProduct>
	</soapenv:Body>
</soapenv:Envelope>