CO3 - BPMNs - CODE/Financiamiento de Deuda - Equipo/256 - ACTIVATE/XML/Request_Pago_Total_Financiamiento.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:activateProduct>
         <!--Optional:-->
         <v1:simpleOrderRequest>
            <channelId>1</channelId>
            <subscriberId>77777703</subscriberId>
            <productId>9002332</productId>
            <quantity>1</quantity>
            <!--Optional:-->
            <externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
            <comment>Financiamiento de Deuda Parcial</comment>
            <additionalParameters>
               <parameter>
                  <key>AMOUNT</key>
                  <value>300</value>
               </parameter>
               <parameter>
                  <key>FEE_VALUE</key>
                  <value>30</value>
               </parameter>
               <parameter>
                  <key>PAID_FEES</key>
                  <value>3</value>
               </parameter>
               <parameter>
                  <key>FEES_TO_PAY</key>
                  <value>3</value>
               </parameter>
               <parameter>
                  <key>TYPE</key>
                  <value>DEUDA</value>
               </parameter>
               <parameter>
                  <key>PAID_TYPE</key>
                  <value>PARTIAL</value>
               </parameter>
            </additionalParameters>
            <!--Optional:-->
         </v1:simpleOrderRequest>
      </v1:activateProduct>
   </soapenv:Body>
</soapenv:Envelope>
