CO3 - BPMNs - CODE/DPG/254 - DEACTIVATE/XML/Request_Devolucion_DPG.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:deactivateProduct>
         <!--Optional:-->
         <v1:simpleOrderRequest>
            <channelId>1</channelId>
            <subscriberId>77777703</subscriberId>
            <productId>9002368</productId>
            <quantity>1</quantity>
            <!--Optional:-->
            <externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
            <comment>Devolucion_DPG</comment>
            <additionalParameters>
               <parameter>
                  <key>eventType</key>
                  <value>DEVOLUCION_DPG</value>
               </parameter>
               <!--<parameter>
                  <key>eventType</key>
                  <value>AFECTACION_DPG</value>
               </parameter>
               -->
               <parameter>
                  <key>ACCOUNT</key>
                  <value>77777703</value>
               </parameter>
               <parameter>
                  <key>AMOUNT</key>
                  <value>18176277</value>
               </parameter>
               <parameter>
                  <key>TYPE</key>
                  <value>DPG</value>
               </parameter>
            </additionalParameters>
            <!--Optional:-->
         </v1:simpleOrderRequest>
      </v1:deactivateProduct>
   </soapenv:Body>
</soapenv:Envelope>