CO3 - BPMNs - CODE/CreditService/XML/SharePoint/BPMN_CREATE_ORDER_RESPONSE.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:purchaseProduct>
         <!--Optional:-->
         <v1:simpleOrderRequest>
            <channelId>1</channelId>
            <subscriberId>77777703</subscriberId>
            <productId>9002333</productId>
            <quantity>1</quantity>
            <!--Optional:-->
            <externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
            <comment>Consulta_Facturas_Abiertas</comment>
            <additionalParameters>
               <parameter>
                  <key>PARENT_ORDER_ID</key>
                  <value>434283482</value>

               </parameter>
            </additionalParameters>
            <!--Optional:-->
         </v1:simpleOrderRequest>
      </v1:purchaseProduct>
   </soapenv:Body>
</soapenv:Envelope>